"Please Donate" = "請贊助";
"Donate" = "贊助";
"This is free software, but it still costs money to write, support, and distribute it. If you enjoy using it, please consider a donation to the authors of this software. It will help to make Cyberduck even better!" = "這是一個免費軟體，但它仍然需要資金來撰寫、支援、散佈。如果你喜愛它，請考慮贊助本軟體開發者，如此可以讓Cyberduck更好！";
"As a contributor to Cyberduck, you receive a registration key that disables this prompt." = "成為Cyberduck的貢獻者，您將收到一個註冊碼可以停止此提示。";
"Thank you for using Cyberduck!" = "感謝您使用 Cyberduck！";
"Later" = "稍後";
"Don't show again for this version" = "這個版本不要再顯示。";
"Registration Key" = "註冊碼";

"Buy in Windows Store" = "Buy in Windows Store";
"Buy in Mac App Store" = "Buy in Mac App Store";

